zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81768/drivers/fsl_sim.h
static inline void SIM_SetLPI2C0TriggerSelection(SIM_Type *base, sim_lpi2c_trigger_selection_t eTriggerSelection)
{
    if (eTriggerSelection == kSIM_Lpi2cSlaveTrigger)
    {
        base->MISC0 &= (uint16_t)(~SIM_MISC0_LPI2C0_TRIG_SEL_MASK);
    }
    else
    {
        base->MISC0 |= SIM_MISC0_LPI2C0_TRIG_SEL_MASK;
    }
}

/*!
 * @brief Gets device currently operate mode, the possible result is normal operate mode or fast operate mode.
 *
 * @param base SIM peripheral base address.
 * @return Current device's operate mode.
 */
static inline sim_device_operate_mode_t SIM_GetDeviceOperateMode(SIM_Type *base)
{
    return (sim_device_operate_mode_t)(uint16_t)((base->MISC0 & SIM_MISC0_MODE_STAT_MASK) >> SIM_MISC0_MODE_STAT_SHIFT);
}

/*!
 * @brief Sets device operate mode, including normal operate mode and fast operate mode.
 *
 * @note The setting by invoking this function is valid after executing the software reset. To change the device
 * operation mode, the clock-related settings also need to be changed. Please use this API with caution.
 *
 * @param base SIM peripheral base address.
 * @param eOperateMode The operate mode to be set, please refer to @ref sim_device_operate_mode_t.
 */
static inline void SIM_SetDeviceOperateMode(SIM_Type *base, sim_device_operate_mode_t eOperateMode)
{
    if (eOperateMode == kSIM_NormalOperateMode)
    {
        base->MISC0 &= (uint16_t)(~SIM_MISC0_FAST_MODE_MASK);
    }
    else
    {
        base->MISC0 |= SIM_MISC0_FAST_MODE_MASK;
    }
}

/*!
 * @brief Enables/Disables the ADC scan control register reorder feature.
 *
 * @param base SIM peripheral base address.
 * @param bEnable Used to control the ADC scan control register reorder feature.
 *              - \b true Enable the re-ordering of ADC scan control bits.
 *              - \b false ADC scan control register works in normal order.
 */
static inline void SIM_EnableADCScanControlReorder(SIM_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->MISC0 |= SIM_MISC0_SCTRL_REORDER_MASK;
    }
    else
    {
        base->MISC0 &= (uint16_t)(~SIM_MISC0_SCTRL_REORDER_MASK);
    }
}

/*!
 * @brief Sets master programmable interval timer
 *
 * @param base SIM peripheral base address.
 * @param eMasterPit The master PIT to be selected, please refer to @ref sim_master_pit_selection_t.
 */
static inline void SIM_SetMasterPIT(SIM_Type *base, sim_master_pit_selection_t eMasterPit)
{
    if (eMasterPit == kSIM_PIT0MasterPIT1Slave)
    {
        base->MISC0 &= (uint16_t)(~SIM_MISC0_PIT_MSTR_MASK);
    }
    else
    {
        base->MISC0 |= SIM_MISC0_PIT_MSTR_MASK;
    }
}

#if defined(FSL_FEATURE_SIM_HAS_BOOT_MODE_OVERRIDE_REGISTER) && (FSL_FEATURE_SIM_HAS_BOOT_MODE_OVERRIDE_REGISTER == 1U)
/*!
 * @brief Sets the boot over ride mode, this API can be used to determine the boot option in the next reset excluding
 * POR.
 *
 * @param base SIM peripheral base address.
 * @param eMode THe boot over ride mode.
 */
static inline void SIM_SetBootOverRide(SIM_Type *base, sim_boot_override_mode_t eMode)
{
    base->BOOT_MODE_OVERRIDE = (base->BOOT_MODE_OVERRIDE & (~SIM_BOOT_MODE_OVERRIDE_BOOT_OVERRIDE_MASK)) |
                               SIM_BOOT_MODE_OVERRIDE_BOOT_OVERRIDE(eMode);
}
#endif

/*!
 * @brief Reads device UID.
 *
 * @param base SIM peripheral base address.
 * @param pDevUID The pointer of external data buffer for device UID.
 */
static inline void SIM_ReadDeviceUID(SIM_Type *base, uint16_t *pDevUID)
{
    uint16_t i;

    if (NULL != pDevUID)
    {
        volatile uint16_t *paddr = (volatile uint16_t *)(&(base->PWRMODE) + 0x9U);

        for (i = 0; i < 8U; i++)
        {
            *pDevUID = paddr[i];
            pDevUID++;
        }
    }
}

/*! @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_SIM_H_*/
